MikroElektronika/core_packages/PIC/XC8/def/PIC18F8620/mcu.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// PORTH<A16>
extern volatile __bit                   A16                 __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 A16_bit             _BIT_ACCESS(PORTH,0)
// PORTH<A17>
extern volatile __bit                   A17                 __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 A17_bit             _BIT_ACCESS(PORTH,1)
// PORTH<A18>
extern volatile __bit                   A18                 __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 A18_bit             _BIT_ACCESS(PORTH,2)
// PORTH<A19>
extern volatile __bit                   A19                 __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 A19_bit             _BIT_ACCESS(PORTH,3)
// SSPCON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSPCON2,5)
// SSPCON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSPCON2,4)
// SSPCON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSPCON2,6)
// PORTD<AD0>
extern volatile __bit                   AD0                 __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 AD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<AD00>
extern volatile __bit                   AD00                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 AD00_bit            _BIT_ACCESS(PORTD,0)
// PORTD<AD01>
extern volatile __bit                   AD01                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 AD01_bit            _BIT_ACCESS(PORTD,1)
// PORTD<AD02>
extern volatile __bit                   AD02                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 AD02_bit            _BIT_ACCESS(PORTD,2)
// PORTD<AD03>
extern volatile __bit                   AD03                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 AD03_bit            _BIT_ACCESS(PORTD,3)
// PORTD<AD04>
extern volatile __bit                   AD04                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 AD04_bit            _BIT_ACCESS(PORTD,4)
// PORTD<AD05>
extern volatile __bit                   AD05                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 AD05_bit            _BIT_ACCESS(PORTD,5)
// PORTD<AD06>
extern volatile __bit                   AD06                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 AD06_bit            _BIT_ACCESS(PORTD,6)
// PORTD<AD07>
extern volatile __bit                   AD07                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 AD07_bit            _BIT_ACCESS(PORTD,7)
// PORTE<AD08>
extern volatile __bit                   AD08                __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 AD08_bit            _BIT_ACCESS(PORTE,0)
// PORTE<AD09>
extern volatile __bit                   AD09                __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 AD09_bit            _BIT_ACCESS(PORTE,1)
// PORTD<AD1>
extern volatile __bit                   AD1                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 AD1_bit             _BIT_ACCESS(PORTD,1)
// PORTE<AD10>
extern volatile __bit                   AD10                __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 AD10_bit            _BIT_ACCESS(PORTE,2)
// PORTE<AD11>
extern volatile __bit                   AD11                __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 AD11_bit            _BIT_ACCESS(PORTE,3)
// PORTE<AD12>
extern volatile __bit                   AD12                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 AD12_bit            _BIT_ACCESS(PORTE,4)
// PORTE<AD13>
extern volatile __bit                   AD13                __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 AD13_bit            _BIT_ACCESS(PORTE,5)
// PORTE<AD14>
extern volatile __bit                   AD14                __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 AD14_bit            _BIT_ACCESS(PORTE,6)
// PORTE<AD15>
extern volatile __bit                   AD15                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 AD15_bit            _BIT_ACCESS(PORTE,7)
// PORTH<AD16>
extern volatile __bit                   AD16                __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 AD16_bit            _BIT_ACCESS(PORTH,0)
// PORTH<AD17>
extern volatile __bit                   AD17                __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 AD17_bit            _BIT_ACCESS(PORTH,1)
// PORTH<AD18>
extern volatile __bit                   AD18                __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 AD18_bit            _BIT_ACCESS(PORTH,2)
// PORTH<AD19>
extern volatile __bit                   AD19                __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 AD19_bit            _BIT_ACCESS(PORTH,3)
// PORTD<AD2>
extern volatile __bit                   AD2                 __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 AD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<AD3>
extern volatile __bit                   AD3                 __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 AD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<AD4>
extern volatile __bit                   AD4                 __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 AD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<AD5>
extern volatile __bit                   AD5                 __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 AD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<AD6>
extern volatile __bit                   AD6                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 AD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<AD7>
extern volatile __bit                   AD7                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 AD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<AD8>
extern volatile __bit                   AD8                 __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 AD8_bit             _BIT_ACCESS(PORTE,0)
// PORTE<AD9>
extern volatile __bit                   AD9                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 AD9_bit             _BIT_ACCESS(PORTE,1)
// ADCON2<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON2,2)
// RCSTA1<ADDEN>
extern volatile __bit _DEPRECATED       ADDEN               __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA1,3)
// RCSTA1<ADDEN1>
extern volatile __bit                   ADDEN1              __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN1_bit          _BIT_ACCESS(RCSTA1,3)
// RCSTA2<ADDEN2>
extern volatile __bit                   ADDEN2              __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 ADDEN2_bit          _BIT_ACCESS(RCSTA2,3)
// ADCON2<ADFM>
extern volatile __bit                   ADFM                __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON2,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// PORTJ<ALE>
extern volatile __bit                   ALE                 __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 ALE_bit             _BIT_ACCESS(PORTJ,0)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTF<AN10>
extern volatile __bit                   AN10                __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 AN10_bit            _BIT_ACCESS(PORTF,5)
// PORTF<AN11>
extern volatile __bit                   AN11                __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 AN11_bit            _BIT_ACCESS(PORTF,6)
// PORTH<AN12>
extern volatile __bit                   AN12                __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 AN12_bit            _BIT_ACCESS(PORTH,4)
// PORTH<AN13>
extern volatile __bit                   AN13                __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 AN13_bit            _BIT_ACCESS(PORTH,5)
// PORTH<AN14>
extern volatile __bit                   AN14                __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 AN14_bit            _BIT_ACCESS(PORTH,6)
// PORTH<AN15>
extern volatile __bit                   AN15                __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 AN15_bit            _BIT_ACCESS(PORTH,7)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,5)
// PORTF<AN5>
extern volatile __bit                   AN5                 __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 AN5_bit             _BIT_ACCESS(PORTF,0)
// PORTF<AN6>
extern volatile __bit                   AN6                 __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 AN6_bit             _BIT_ACCESS(PORTF,1)
// PORTF<AN7>
extern volatile __bit                   AN7                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 AN7_bit             _BIT_ACCESS(PORTF,2)
// PORTF<AN8>
extern volatile __bit                   AN8                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 AN8_bit             _BIT_ACCESS(PORTF,3)
// PORTF<AN9>
extern volatile __bit                   AN9                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 AN9_bit             _BIT_ACCESS(PORTF,4)
// PORTJ<BA0>
extern volatile __bit                   BA0                 __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 BA0_bit             _BIT_ACCESS(PORTJ,4)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// LVDCON<BGST>
extern volatile __bit                   BGST                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 BGST_bit            _BIT_ACCESS(LVDCON,5)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// TXSTA1<BRGH>
extern volatile __bit _DEPRECATED       BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA1,2)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// TXSTA2<BRGH2>
extern volatile __bit                   BRGH2               __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 BRGH2_bit           _BIT_ACCESS(TXSTA2,2)
// CMCON<C1INV>
extern volatile __bit                   C1INV               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 C1INV_bit           _BIT_ACCESS(CMCON,4)
// CMCON<C1OUT>
extern volatile __bit _DEPRECATED       C1OUT               __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CMCON,6)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CMCON<C2INV>
extern volatile __bit                   C2INV               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 C2INV_bit           _BIT_ACCESS(CMCON,5)
// CMCON<C2OUT>
extern volatile __bit _DEPRECATED       C2OUT               __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 C2OUT_bit           _BIT_ACCESS(CMCON,7)
// PORTF<C2OUTF>
extern volatile __bit                   C2OUTF              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 C2OUTF_bit          _BIT_ACCESS(PORTF,1)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTE<CCP2C>
extern volatile __bit                   CCP2C               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2C_bit           _BIT_ACCESS(PORTE,7)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTG<CCP3>
extern volatile __bit                   CCP3                __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 CCP3_bit            _BIT_ACCESS(PORTG,0)
// PIE3<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR3,0)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7DB9);	// @ (0xFB7 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7DBA);	// @ (0xFB7 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7DBB);	// @ (0xFB7 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PORTG<CCP4>
extern volatile __bit                   CCP4                __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 CCP4_bit            _BIT_ACCESS(PORTG,3)
// PIE3<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR3,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
